Catalogs/ВидыДоходовНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ВидыДоходовНДФЛ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогообложенияРезидента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавкиНалогообложенияРезидента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОблагаетсяУНалоговогоАгента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПрименяемыйВНалоговойОтчетностиС2010Года</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычетРассчитываетсяАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычетПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетЕдинственныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетОплатеТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/НДФЛСтавкиНалогообложенияРезидента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>НДФЛСтавкиНалогообложенияРезидента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ставка09</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка35</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка16</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыДоходовНДФЛ/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗарплатаКадрыВызовСервера.ПодготовитьДанныеВыбораКлассификаторовСПорядкомКодов(ДанныеВыбора, Параметры, СтандартнаяОбработка, "Справочник.ВидыДоходовНДФЛ");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьКодыДоходовНДФЛ();
	
	// 4D:ERP для Беларуси, Петр, 19.12.2017 9:26:42 
	// Спр. Виды вычетов по подоходному налогу, № 17173
	// {
	ЗаполнитьКодыДоходовНДФЛНеИспользуется()
	// }
	// 4D
	
КонецПроцедуры

// Выполняет заполнение справочника "ВидыДоходовНДФЛ".
//
Процедура ЗаполнитьКодыДоходовНДФЛ()
	
	// 4D:ERP для Беларуси, Анна, 24.08.2017 12:16:56 
	// Редактировать спр. Виды доходов подоходного налога, № 15792
	// Сообщения об ошибках при заполнении налоговой ставки для видов дохода подоходного налога, № 17036
	// Редактировать справочник "Виды доходов по подоходному налогу", № 17444
	// {
	Ставка09 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09;
	Ставка10 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка10;
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	Ставка35 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
	Ставка16 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка16;
	НеОблагается = Перечисления.НДФЛСтавкиНалогообложенияРезидента.НеОблагается;
	ВидыДоходовНДФЛ = Справочники.ВидыДоходовНДФЛ;
	ВычетыНДФЛ = Справочники.ВидыВычетовНДФЛ;
	
	// Заполнение реквизитов предопределенных элементов.
	ОписатьКодДоходаНДФЛ("Код1010", 			Ставка09, "1010", "(не используется) Дивиденды", Ложь, Истина, ВычетыНДФЛ.Код601);
	ОписатьКодДоходаНДФЛ("Код1211", 			Ставка13, "1211", "(не используется) Доходы, полученные в виде сумм страховых взносов по договорам страхования, если указанные суммы вносятся за физических лиц из средств работодателей", Ложь, Истина, ВычетыНДФЛ.Код607);
	ОписатьКодДоходаНДФЛ("Код1300", 			Ставка13, "1300", "(не используется) Доходы, полученные налогоплательщиком от использования в РФ авторских или иных смежных прав (кроме авторских вознаграждений)");
	ОписатьКодДоходаНДФЛ("Код2010", 			Ставка13, "2010", "(не используется) Выплаты по договорам гражданско-правового характера (за исключением авторских вознаграждений)", Ложь, Истина, ВычетыНДФЛ.Код403);
	ОписатьКодДоходаНДФЛ("Код2201", 			Ставка13, "2201", "(не используется) Авторские вознаграждения (вознаграждения) за создание литературных произведений, в том числе для театра, кино, эстрады и цирка", Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2202", 			Ставка13, "2202", "(не используется) Авторские вознаграждения (вознаграждения) за создание художественно-графических произведений, фоторабот для печати, произведений архитектуры и дизайна", Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2203", 			Ставка13, "2203", "(не используется) Авторские вознаграждения (вознаграждения) за создание произведений скульптуры, живописи, театрально- и кинодекорационного искусства и графики", Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2204", 			Ставка13, "2204", "(не используется) Авторские вознаграждения (вознаграждения) за создание аудиовизуальных произведений (видео-, теле- и кинофильмов)", Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2205", 			Ставка13, "2205", "(не используется) Авторские за создание музыкальных произведений: музыкально-сценических, симфонических, хоровых, камерных, для духового оркестра, для фильмов и театра", Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2206", 			Ставка13, "2206", "(не используется) Авторские вознаграждения (вознаграждения) за создание других музыкальных произведений, в том числе подготовленных к опубликованию", Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2207", 			Ставка13, "2207", "(не используется) Авторские вознаграждения (вознаграждения) за исполнение произведений литературы и искусства", Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2208", 			Ставка13, "2208", "(не используется) Авторские вознаграждения (вознаграждения) за создание научных трудов и разработок", Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2209", 			Ставка13, "2209", "(не используется) Авторские вознаграждения за открытия, изобретения, промышленные образцы", Истина, Ложь, ВычетыНДФЛ.Код405);
	// не облагается у НА
	ОписатьКодДоходаНДФЛ("Код2210", 			Ставка13, "2210", "(не используется) Вознаграждение, выплачиваемое наследникам (правопреемникам) авторов произведений науки, литературы, искусства, открытий, изобретений и пром. образцов", , , , Истина);
	ОписатьКодДоходаНДФЛ("Код2610",				Ставка35, "2610", "(не используется) Материальная выгода, полученная от экономии на процентах за пользование заемными (кредитными) средствами");
	ОписатьКодДоходаНДФЛ("Код2720", 			Ставка13, "2720", "(не используется) Стоимость подарков", Истина, Истина, ВычетыНДФЛ.Код501);
	ОписатьКодДоходаНДФЛ("Код2730", 			Ставка13, "2730", "(не используется) Стоимость призов в денежной и натуральной форме на конкурсах и соревнованиях, проводимых в соотв. с решениями Правительства РФ и др. органов власти", Истина, Истина, ВычетыНДФЛ.Код502);
	ОписатьКодДоходаНДФЛ("Код2740", 			Ставка35, "2740", "(не используется) Стоимость выигрышей и призов, получаемых в проводимых конкурсах, играх и других мероприятиях в целях рекламы товаров, работ и услуг", Истина, Истина, ВычетыНДФЛ.Код505);
	ОписатьКодДоходаНДФЛ("Код2760", 			Ставка13, "2760", "(не используется) Материальная помощь, оказываемая работодателями своим работникам, а также бывшим своим работникам, уволившимся в связи с выходом на пенсию", Истина, Истина, ВычетыНДФЛ.Код503);
	ОписатьКодДоходаНДФЛ("Код2761", 			Ставка13, "2761", "(не используется) Материальная помощь, оказываемая инвалидам общественными организациями инвалидов", Истина, Истина, ВычетыНДФЛ.Код506);
	ОписатьКодДоходаНДФЛ("Код2762",				Ставка13, "2762", "(не используется) Материальная помощь, оказываемая работодателями своим работникам при рождении (усыновлении) ребенка", Истина, Истина, ВычетыНДФЛ.Код508);
	ОписатьКодДоходаНДФЛ("Код2770", 			Ставка13, "2770", "(не используется) Возмещение (оплата) работодателями своим работникам и членам их семьи, бывшим своим работникам-пенсионерам, а также инвалидам стоимости медикаментов", Истина, Истина, ВычетыНДФЛ.Код504);
	ОписатьКодДоходаНДФЛ("Код2790", 			Ставка13, "2790", "(не используется) Сумма помощи (в денежной и натуральной форме), стоимость подарков, полученных ветеранами, инвалидами Великой Отечественной войны и приравненных к ним", Истина, Истина, ВычетыНДФЛ.Код507);
	ОписатьКодДоходаНДФЛ("Код2791", 			Ставка13, "2791", "(не используется) Доходы, полученные работниками в натуральной форме в качестве оплаты труда от с/х товаропроизводителей, упл-х ЕСХН, и крестьянских х-в", Ложь, Истина, ВычетыНДФЛ.Код509);
	ОписатьКодДоходаНДФЛ("Код4800", 			Ставка13, "4800", "(не используется) Иные доходы", Ложь, Истина, ВычетыНДФЛ.Код620);
	ОписатьКодДоходаНДФЛ("Код16311",			НеОблагается, "16311",         "Пособия по гос. и соц. страх-нию и обесп-нию (кроме пособий по врем. нетрудоспособности) выплач. из ФСЗН согласно пп.1.1 п.1 ст.163 НК РБ ОЧ", Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163110",			НеОблагается, "163110",        "Стоимость путевок, за искл. турист-их, в санат.-курортн. и оздор. учрежд., оплач. за счет средств соц. страхов. и бюджета пп.1.10 п.1 ст.163 НК РБ ОЧ", Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163111",			НеОблагается, "163111",        "Стипендии учащихся, студентов и др. за счет средств бюджета согл. пп.1.11 п.1 ст.163 НК РБ ОЧ", Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163112",			НеОблагается, "163112",        "Стипендии, учреждаемые Президентом РБ, поощрения спец. фонда Президента РБ по поддержке талантл. молодежи согласно пп.1.12 п.1 ст.163 НК РБ ОЧ", Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163113",			Ставка13,     "163113",        "Доходы в виде опл.труда и иные суммы в иностр.валюте,получ. за работу за предел. террит.РБ плательщиками от гос.органов и др. юр.лиц пп.1.13 п.1 ст163", Ложь, Истина, ВычетыНДФЛ.Код163113);
	ОписатьКодДоходаНДФЛ("Код163114",			НеОблагается, "163114",        "Суммы оплаты труда граждан РБ, направл. на работу за пред.террит.РБ по соглас.с республ-ими органами гос.управл. в органы интеграции пп.1.14 п.1 ст163", Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163115",		    Ставка13,     "163115",        "Доходы плательщиков, получ. от животноводства, растениводства согл. пп.1.15 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ВычетыНДФЛ.Код571);
	ОписатьКодДоходаНДФЛ("Код163116",		    НеОблагается, "163116",        "Доходы,получ.от сбора/сдачи лекарств.растит.сырья и др. дикораст.продукц. орг-ям/ИП, осущ.деят.по загот. указанной продукц. пп.1.16 п.1ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163117",		    НеОблагается, "163117",        "Доходы плат., получ. от физ.лиц в виде наследства, за искл.вознагр.,выплач.наследн.авторов произвед.и иных рез.интел. деят. пп.1.17 п.1ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);	
	ОписатьКодДоходаНДФЛ("Код163118",	        Ставка13,     "163118",        "Доходы от физ.лиц, не явл.индив.предпр-ми, размере не превыш.заданный предел в НК (дарение, недвиж.имущ-во по дог.ренты) пп.1.18 п.1 ст.163 НК РБ ОЧ",Ложь, Истина,ВычетыНДФЛ.Код520);
	ОписатьКодДоходаНДФЛ("Код16312",	        НеОблагается, "16312",         "Пенсии, получаемые в соотв. с закон-вом РБ и (или) закон-вом иностр. гос-в, ежемес. денеж. содерж. отдельным гос. служащим пп.1.2 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163120",	        Ставка13,     "163120",        "Призы, получен. спортсменами в размерах, определ. Президентом и (или) Советом Министров РБ согл. пп.1.20 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ВычетыНДФЛ.Код510);
	ОписатьКодДоходаНДФЛ("Код163120_1",	        Ставка13,     "163120_1",      "Ден. премии, выплач. победит. ежегодн. соревнований за достижение высоких показ.на уборке урожая зерновых и зернобобовых пп.1.20_1 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ВычетыНДФЛ.Код163120_1);
	ОписатьКодДоходаНДФЛ("Код163122",	        НеОблагается, "163122",        "Вознаграждения, выплачиваемые за передачу в государственную собственность кладов согласно пп.1.22 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163123",	        НеОблагается, "163123",        "Выигрыши в лотереях согласно пп.1.23 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163123_",	        НеОблагается, "163123_",       "Выигрыши от организаций (ИП) осущ. игорн. деят. согласно пп.1.23 п.1ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163124",	        НеОблагается, "163124",        "Доходы плательщ., получ. от реализ. (погашения) облигаций, эмитированных с 1 апреля 2008 года юр. лицами РБ согл. пп.1.24 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163124_1",	        НеОблагается, "163124_1",      "Доходы плат., получ. от реализ. долей в уставн. фонде бел. орг-ций, принадл. физ.лицу непрер. не менее трех лет согласно пп.1.24_1 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163127",	        НеОблагается, "163127",        "Одноразовые безвозмездные субсидии на покупку (строительство) жилья согласно пп.1.27 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163129",	        НеОблагается, "163129",        "Стоимость форменной одежды, выдаваемой в соответствии с законодательством согласно пп.1.29 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код16313",	        НеОблагается, "16313",         "Все виды компенсаций, предусм.закон.актами, постан.(за иск.компенс.за неисп.отпуск, износ транс.ср-в)в  пределах норм согл.пп.1.3 п.1 ст.163 НК  РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163130",	        НеОблагается, "163130",        "Доходы, получ. плательщиками от сдачи организациям и (или) ИП втор. сырья по перечню, установленному Советом Министров РБ пп.1.30 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163135",	        НеОблагается, "163135",        "Дох., получ. плательщ., имеющ.право на социал.вычет; получ.первое образ.в РБ (высш. сред.спец., проф.технич.) от организ. (ИП) пп.1.35 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163136",	        НеОблагается, "163136",        "Ден. довольств.,получ. по месту службы женщинами из числа лиц военнослуж.,за период их нахожд.в соц.отпуске по бер.и родам пп.1.36 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163138",	        НеОблагается, "163138",        "Стоимость объема содержания с иждивением получателя ренты по договору пожизненного содержания с иждивением согласно пп.1.38 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163139",	        НеОблагается, "163139",        "Доходы учащихся ПТУ и общеобразоват. заведений, связанные с учебно-произв. процессом согласно пп.1.39 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код16313выхпенс",	    Ставка13,     "16313вых.пенс", "Вых. пособия с вых. на пенсию, не превыш. 9-ти среднемес. зарплат пп.1.3 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ВычетыНДФЛ.Код16313);
	ОписатьКодДоходаНДФЛ("Код16313выхпос",	    Ставка13,     "16313вых.пос",  "Вых.пособия в связи с прекращением труд. договора (контракта) в  пределах норм согл. абзаца 5 пп.1.3 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ВычетыНДФЛ.Код16313выхпос);
	ОписатьКодДоходаНДФЛ("Код16314", 			НеОблагается, "16314",         "Доходы, получ.за сдачу крови и др.виды донорства, сдачу матер.молока  согл. пп.1.4 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код16315", 		    НеОблагается, "16315",         "Алименты, получ.плательщиками в случ.устан.закон-вом согл. пп.1.5 п.1ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код16316", 		    НеОблагается, "16316",         "Государственные премии РБ согласно пп.1.6 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код16317", 		    Ставка13,     "16317",         "Ежемес. ден. выплаты физ лицам имеющим звание народный согласно пп.1.7 п.1 ст.163 НК РБ ОЧ",Ложь, Истина,ВычетыНДФЛ.Код3117);
	ОписатьКодДоходаНДФЛ("Код16318", 			НеОблагается, "16318",	       "Сумма единовременной мат.помощи пп.1.8 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код16319", 			НеОблагается, "16319",	       "Суммы материальной помощи, оказываемой в соответствии с законодательными актами, постановлениями Совета Министров Республик пп.1.9 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163143", 			НеОблагается, "163143",	       "Доходы в виде ежемес.ден.выплат родит.-воспитат.,опекунам,приемн. родител. детей-сирот и детей, оставш. без попеч. родит., пп.1.43 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163144", 			НеОблагается, "163144",	       "Ден.средства,поступ.с 2006 г. физ.лицам РБ в виде грантов и в рамках проектов, предост.в соотв.с Соглаш. о научн. сотрудн. пп.1.44 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163144_1", 	    НеОблагается, "163144_1",	   "Доходы в виде грантов Президента Республики Беларусь в науке, образовании, здравоохранении, культуре согл. пп.1.44_1 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163145", 	        НеОблагается, "163145",	       "Стоимость жилых помещений в домах государственного жилищного фонда, занимаемых по договору найма военнослужащими согласно пп.1.45 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163146", 	        НеОблагается, "163146",	       "Доходы, полученные молодыми и многодетными семьями, состоящими на учете нуждающ. в улучшении жилищных условий согласно пп.1.46 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163147", 	        НеОблагается, "163147",	       "Доходы плательщ.-ИП, получ. от реализ. товаров (работ,услуг) в объект.придор.сервиса в  теч.пяти лет с даты ввода в экспл. пп.1.47 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163148", 	        НеОблагается, "163148",	       "Доходы в виде оплаты, начислен. в связи с республиканским субботником согласно пп.1.48 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163151", 	        НеОблагается, "163151",	       "Доходы адвокатов (за искл. адвокатов, осуществляющих адвок. деят. индив.), полученные от осуществл. адвок. деят. согласно пп.1.51 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163152", 	        НеОблагается, "163152",	       "Доходы нотариусов, осущ. нотариальную деят.в нотар. конторах, получ. от осущ. нотариальной деят.и напр. ими на упл. взнос. пп.1.52 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163153", 	        НеОблагается, "163153",	       "Доходы в размере номинальной стоимости жилищных облигаций и процентного дохода по ним согласно пп.1.53 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163154", 	        НеОблагается, "163154",	       "Доходы,получ.детьми в возр.от 14 до 18 лет за раб.в период нахожд.в лагерях труда и отдыха,осущ.свою деят.в соотв.с закон. пп.1.54 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("КодДоходаПоУмолчанию", Ставка13,    "2000",	       "Вознаграждение за выполнение трудовых или иных обязанностей; денежное содержание и иные налогооблагаемые выплаты военнослужащим и приравненным к ним",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код401",              Ставка13,     "401",	       "Доходы по операциям с ценными бумагами",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код402",              Ставка13,     "402",	       "Доходы по операциям с финансовыми инструментами срочных сделок",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код403",              Ставка13,     "403",	       "Доходы по операциям с ценными бумагами и финансовыми инструментами срочных сделок, осуществляемым доверительным управляющим",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код404",              Ставка13,     "404",	       "Доходы по операциям доверительного управления денежными средствами",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код405",              Ставка13,     "405",	       "Доходы от участия в фондах банковского управления",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код406",              Ставка09,     "406",	       "Доходы, получ. физ.лицами (кроме работн., осущ. обслуж./охрану зданий,помещений,земельных участков) от резидентов Парка высок. технол. по труд. догов.",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код407",              Ставка09,     "407",	       "Доходы, полученные индивидуальными предпринимателями - резидентами Парка высоких технологий",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код408",              Ставка09,     "408",	       "Доходы, получ.физ.лицами,участв.в реализ.зарегистр. в установл. порядке бизнес-проекта в сфере новых и выс.технол.,от нерезидентов ПВТ по труд. догов.",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код409",              Ставка09,     "409",	       "Доходы, получ.физ. лиц. в виде оплаты труда, получ. по труд. договор. от совместной компании и (или) резидентов Китайско-Белорусского индустр. парка",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код410",              Ставка10,     "410",	       "Доходы, получ.по труд. договорам от организ. и ИП, зарег-ых с 1 июля 2015 г. по 31 декабря 2020 г на террит. юго-вост. региона Могил.обл.",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код500", 			    Ставка13,     "500", 	       "Доходы, не явл. вознагр. за труд, получаемые по месту осн. работы, в сумме, не превышающей установл. абз.2 части 1 пп.1.19 п.1 ст.163 НК РБ ОЧ размер",Ложь, Истина,ВычетыНДФЛ.Код500);
	ОписатьКодДоходаНДФЛ("Код500иныеорг",  	    Ставка13,     "500иныеорг",    "Доходы, не явл.вознг.за труд от иных орг-ций и ИП в сумме, не превыш. установл. абз.3 части 1.пп.1.19 п.1 ст.163 НК РБ ОЧ размер",Ложь, Истина,ВычетыНДФЛ.Код500иныеорг);
	ОписатьКодДоходаНДФЛ("Код501",	            Ставка13,     "501",           "Спонсор.помощь в ден/натур.формах от орг-ций, физ.лиц. инвалидами, сиротами и др, в сумме непревыш. установл. абз.2 пп.1.21 п.1 ст.163 НК РБ ОЧ размер",Ложь, Истина, ВычетыНДФЛ.Код3136);
	ОписатьКодДоходаНДФЛ("Код502", 		        Ставка13, 	  "502", 	       "Сумма мат помощи, стоим-ть подарков из средств профсоюзов, в сумме, не превыш. установл. частью 1 пп.1.26 п.1 ст.163 НК РБ ОЧ размер",Ложь, Истина,ВычетыНДФЛ.Код540);
	ОписатьКодДоходаНДФЛ("Код503", 		        Ставка13, 	  "503", 	       "Оплата страх. услуг страх.орг., получаемых от орг. и ИП, по осн.месту (в т.ч. пенсионерами), в сумме, не превыш. установл. пп.1.19_1 п.1 ст.163 размер",Ложь, Истина,ВычетыНДФЛ.Код1503);
	ОписатьКодДоходаНДФЛ("Код504", 		        Ставка13, 	  "504", 	       "Стоимость путевок в орг-ции РБ, д/детей до 18 лет и оплач.за счет средств бел.орг.;ИП, в сумме,не превыш. устан.. пп.1.10_1 п.1 ст.163 НК РБ ОЧ размер",Ложь, Истина,ВычетыНДФЛ.Код163110_1);
	ОписатьКодДоходаНДФЛ("Код505", 		        НеОблагается, "505", 	       "Доходы, освобожд.от налогообл.мест.Советами депутатов (мест.исполнит.и распоряд.органами)",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163133", 		    НеОблагается, "591", 	       "Доходы от возмездного отчуждения согласно пп.1.33 п.1 ст.163 согласно НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код592", 		        НеОблагается, "592", 	       "Доходы от возмездного отчуждения одного жилого дома согл.абзаца 1 пп.1.33 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код593", 		        НеОблагается, "593", 	       "Доходы от возмездного отчуждения одной дачи согл.абзаца 1пп.1.33 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код594", 		        НеОблагается, "594", 	       "Доходы от возмездного отчуждения одного садового домика с хозяйственными постройками согл.абзаца 1 пп.1.33 п.1ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код595", 		        НеОблагается, "595", 	       "Доходы от возмездного отчуждения одного гаража согл.абзаца 1 пп.1.33 п.1ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код596", 		        НеОблагается, "596", 	       "Доходы от возмездного отчуждения одного земельного участка согл.абзаца 1 пп.1.33 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код597", 		        НеОблагается, "597", 	       "Доходы от возмездного отчуждения прочего имущества, принадл. на праве собственности согл.абзаца 3 пп.1.33 п.1 ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код598", 		        НеОблагается, "598", 	       "Доходы от возмездного отчуждения одного автомобиля либо другого транспортного средства согл. абзаца 2 пп.1.33 п.1ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код163128", 		    НеОблагается, "528", 	       "Взносы, возвр-мые физ.лицам при прекращении стр-ва, выбытии из членов строит.кооп согласно пп.1.28п.1ст.163 НК РБ ОЧ",Ложь, Истина, ,Истина);
	ОписатьКодДоходаНДФЛ("Код4000", 		    Ставка16,     "4000", 	       "Доходы, получаемые белорусскими индивидуальными предпринимателями от осуществления предпринимательской  деятельности",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код4600", 		    Ставка16,     "4600", 	       "Доходы, получаемые белорусскими нотариусами, адвокатами от осуществления нотариальной, осуществляемой индивидуально адвокатской деятельности",Ложь, Истина);
	ОписатьКодДоходаНДФЛ("Код4800", 		    Ставка13,     "4800 (п)", 	   "Иные доходы",Ложь, Истина);
	// }
	// 4D
	
КонецПроцедуры 

// 4D:ERP для Беларуси, Петр, 19.12.2017 9:26:42 
// Спр. Виды вычетов по подоходному налогу, № 17173
// {
Процедура ЗаполнитьКодыДоходовНДФЛНеИспользуется() Экспорт

	ОписатьКодДоходаНДФЛНеИспользуется("Код1010");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1211");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1300");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1530");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1531");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1532");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1533");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1535");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1536");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1537");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1538");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1539");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1541");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1543");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1544");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1545");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1546");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1547");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1548");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1549");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1551");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1552");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1553");
	ОписатьКодДоходаНДФЛНеИспользуется("Код1554");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2002");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2003");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2010");
	
	Для НомерКода = 1 по 9 Цикл
		ОписатьКодДоходаНДФЛНеИспользуется("Код220" + Строка(НомерКода));
	КонецЦикла;
	
	ОписатьКодДоходаНДФЛНеИспользуется("Код2210");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2610");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2720");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2730");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2740");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2760");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2761");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2762");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2770");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2790");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2791");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2510");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2520");
	ОписатьКодДоходаНДФЛНеИспользуется("Код2530");

КонецПроцедуры

Процедура ОписатьКодДоходаНДФЛНеИспользуется(ИмяПредопределенныхДанных, Изменение = "(не используется)")
	
	СсылкаПредопределенного = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходовНДФЛ." + ИмяПредопределенныхДанных);
	
	Если СсылкаПредопределенного <> Неопределено Тогда 
		
		Элемент = СсылкаПредопределенного.ПолучитьОбъект();
		
		Если СтрЧислоВхождений(Элемент.Наименование, Изменение) = 0 Тогда
			
			Элемент.Наименование = Изменение + Элемент.Наименование;
			
			Если Элемент.Модифицированность() Тогда
				Элемент.ОбменДанными.Загрузка = Истина;
				Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
				Элемент.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
// }
// 4D

// Выполняет заполнение справочника "ВидыДоходовНДФЛ" не предопределенными элементами.
//
Процедура СоздатьКодыДоходовНДФЛ() Экспорт
	
	Ставка09 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09;
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	Ставка35 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
	
	// Добавление непредопределенных кодов доходов.
	// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ.
	ОписатьКодДоходаНДФЛ(, Ставка13, "1011", "Проценты, включая дисконт, полученный по долговому обязательству любого вида (за исключением доходов с кодами 1110, 2800 и 3020).");
	ОписатьКодДоходаНДФЛ(, Ставка09, "1110", "Проценты по облигациям с ипотечным покрытием, эмитированным до 01.01.2007");
	ОписатьКодДоходаНДФЛ(, Ставка09, "1120", "Доходы учредителей доверительного управления ипотечным покрытием, полученные на основании приобретения ипотечных сертификатов, выданных до 01.01.2007");
	ОписатьКодДоходаНДФЛ(, Ставка13, "1200", "Доходы, полученные в виде иных страховых выплат по договорам страхования");
	ОписатьКодДоходаНДФЛ(, Ставка13, "1201", "Доходы, полученные в виде страховых выплат по договорам страхования в виде оплаты стоимости санаторно-курортных путевок"); 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1202", "Доходы, полученные в виде страховых выплат по договорам добровольного страхования жизни (за исключением добровольного пенсионного страхования)"); 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1203", "Доходы, полученные в виде страховых выплат по договорам добровольного имущественного страхования (включая страхование гражданской ответственности)"); 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1212", "Доходы в виде денежных (выкупных) сумм, выплачиваемых по договорам страхования при досрочном расторжении договоров страхования");
	ОписатьКодДоходаНДФЛ(, Ставка13, "1213", "Доходы в виде денежных (выкупных) сумм при расторжении договора за вычетом сумм страховых взносов, уплаченных по договору добр. пенс. страхования"); 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1220", "Доходы в виде денежных (выкупных) сумм, выплачиваемые по договорам негосударственного пенсионного обеспечения");
	ОписатьКодДоходаНДФЛ(, Ставка13, "1240", "Суммы пенсий, выплачиваемых по договорам негосударственного пенсионного обеспечения");
	ОписатьКодДоходаНДФЛ(, Ставка13, "1301", "Доходы, полученные от отчуждения авторских или иных смежных прав"); 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1400", "Доходы от сдачи в аренду и иного использования имущества (кроме доходов от сдачи в аренду транспортных средств, средств связи, компьютерных сетей)");
	ОписатьКодДоходаНДФЛ(, Ставка13, "1540", "Доходы, полученные от реализации долей участия в уставном капитале организаций ");
	ОписатьКодДоходаНДФЛ(, Ставка13, "1550", "Доходы, полученные налогоплательщиком при уступке прав требования по договору участия в долевом строительстве (договору инвестирования и др.)");
	ОписатьКодДоходаНДФЛ(, Ставка13, "2001", "Вознаграждение директоров и иные аналогичные выплаты, получаемые членами органа управления организации (совета директоров или иного подобного органа)");
	ОписатьКодДоходаНДФЛ(, Ставка13, "2012", "Суммы отпускных выплат");
	ОписатьКодДоходаНДФЛ(, Ставка13, "2300", "Пособия по временной нетрудоспособности");
	ОписатьКодДоходаНДФЛ(, Ставка13, "2400", "Доходы от использования любых транспортных средств в связи с перевозками, включая штрафы; трубопроводов, ЛЭП, линий связи, компьютерных сетей");
	ОписатьКодДоходаНДФЛ(, Ставка13, "2630", "Материальная выгода, полученная от приобретения товаров, работ, услуг у физ. лиц, организаций, явл. взаимозависимыми по отношению к налогоплательщику");
	ОписатьКодДоходаНДФЛ(, Ставка13, "2640", "Материальная выгода, полученная от приобретения ценных бумаг");
	ОписатьКодДоходаНДФЛ(, Ставка13, "2710", "Материальная помощь (за исключением материальной помощи, учитываемой с кодами 2760 и 2761)");
	ОписатьКодДоходаНДФЛ(, Ставка13, "2750", "Стоимость призов в денежной и натуральной форме (за исключением стоимости призов, учитываемой с кодами 2730 и 2740)");
	ОписатьКодДоходаНДФЛ(, Ставка13, "2780", "Возмещение (оплата) стоимости приобретенных налогоплательщиком медикаментов в случаях, не подпадающих под действие п. 28 ст. 217 НК РФ");
	ОписатьКодДоходаНДФЛ(, Ставка13, "2800", "Проценты (дисконт), полученные при оплате предъявленного к платежу векселя");
	ОписатьКодДоходаНДФЛ(, Ставка13, "2900", "Доходы, полученные от операций с иностранной валютой");
	ОписатьКодДоходаНДФЛ(, Ставка13, "3010", "Доходы в виде выигрышей, полученных в букмекерской конторе и тотализаторе");
	ОписатьКодДоходаНДФЛ(, Ставка35, "3020", "Доходы в виде процентов, получаемых по вкладам в банках");
	
КонецПроцедуры 

Процедура СоздатьКодыДоходовНДФЛДекабрь2011() Экспорт 
	
	Ставка35 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
	
	// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ.
	ОписатьКодДоходаНДФЛ(, Ставка35, "3022", "Доходы в виде платы за использование денежных средств членов кр.потреб.кооператива или %% за исп-е с-х кр.потреб.кооперативом займов (с 01.01.2011)");

КонецПроцедуры	

Процедура ОбновлениеДоходовВычетовНДФЛНеПредопределенныхЯнварь2012() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоходыНДФЛ.Ссылка
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ДоходыНДФЛ
	|ГДЕ
	|	ДоходыНДФЛ.Код = ""1541""
	|	И НЕ ДоходыНДФЛ.Предопределенный
	|	И НЕ ДоходыНДФЛ.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.КодПрименяемыйВНалоговойОтчетностиС2010Года = "-";
		Объект.ПометкаУдаления = Истина;
		Объект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Объект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроставитьКодамНатуральныхДоходовПризнакПредопределенного() Экспорт

	НачатьТранзакцию();

	КодыДляИнициализации = Новый Структура("Код2510,Код2520,Код2530");
	
	СтрокаПодстановки = "Код%1";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Код КАК Код,
	|	ВидыДоходовНДФЛ.Предопределенный КАК Предопределенный,
	|	МАКСИМУМ(ВидыДоходовНДФЛ.Ссылка) КАК Ссылка
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	(ВидыДоходовНДФЛ.Код = ""2510""
	|			ИЛИ ВидыДоходовНДФЛ.Код = ""2520""
	|			ИЛИ ВидыДоходовНДФЛ.Код = ""2530"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыДоходовНДФЛ.Код,
	|	ВидыДоходовНДФЛ.Предопределенный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИмяПредопределенныхДанных = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			СтрокаПодстановки, Выборка.Код);
		
		// Если "встретился" предопределенный элементы, значит ранее он уже был инициализирован.
		Если Выборка.Предопределенный Тогда
			КодыДляИнициализации.Удалить(ИмяПредопределенныхДанных);
			Продолжить;
		КонецЕсли;

		ЭлементДляУдаления = Справочники.ВидыДоходовНДФЛ[ИмяПредопределенныхДанных].ПолучитьОбъект();		
		ЭлементДляУдаления.ОбменДанными.Загрузка = Истина;
		ЭлементДляУдаления.Удалить();
		
		КодыДляИнициализации.Удалить(ИмяПредопределенныхДанных);
		
		Элемент = Выборка.Ссылка.ПолучитьОбъект();
		Элемент.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
		Элемент.ОбменДанными.Загрузка = Истина;
		Элемент.Записать();
		
	КонецЦикла;
	
	// Инициализация предопределенных элементов, дубликаты которых в справочнике найдены не были.
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	
	Для Каждого КодДляИнициализации Из КодыДляИнициализации Цикл
		
		Если КодДляИнициализации.Ключ = "Код2510" Тогда
			ОписатьКодДоходаНДФЛ("Код2510", Ставка13, "2510", "Оплата за налогоплательщика товаров, работ, услуг или имущественных прав, в том числе коммунальных услуг, питания, отдыха, обучения в его интересах");
		ИначеЕсли КодДляИнициализации.Ключ = "Код2520" Тогда
			ОписатьКодДоходаНДФЛ("Код2520", Ставка13, "2520", "Стоимость товаров, работ, услуг, полученных на безвозмездной основе");
		ИначеЕсли КодДляИнициализации.Ключ = "Код2530" Тогда
			ОписатьКодДоходаНДФЛ("Код2530", Ставка13, "2530", "Оплата труда в натуральной форме", , , , , Истина);
		КонецЕсли;

	КонецЦикла;
	
	ЗафиксироватьТранзакцию();

	
КонецПроцедуры

Процедура УстановитьСтавкуДоходу3022() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	ВидыДоходовНДФЛ.Код = ""3022""
	|	И ВидыДоходовНДФЛ.СтавкаНалогообложенияРезидента <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОписатьКодДоходаНДФЛ(Выборка.Ссылка, Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35);
	КонецЕсли;	

КонецПроцедуры

Процедура ПроставитьКодамДоходаОтношениеКОплатеТруда() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	(ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию)
	|			ИЛИ ВидыДоходовНДФЛ.Код = ""2530"")
	|	И НЕ ВидыДоходовНДФЛ.СоответствуетОплатеТруда";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элемент = Выборка.Ссылка.ПолучитьОбъект();
		Элемент.СоответствуетОплатеТруда = Истина;
		Элемент.ОбменДанными.Загрузка = Истина;
		Элемент.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКодыДоходов2014() Экспорт 
	
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	ВычетыНДФЛ = Справочники.ВидыВычетовНДФЛ;	
	
	ОписатьКодДоходаНДФЛ("Код1530", Ставка13, "1530", "Доходы, полученные по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг", Ложь, Ложь, ВычетыНДФЛ.Код201);
	ОписатьКодДоходаНДФЛ("Код1531", Ставка13, "1531", "Доходы, полученные от операций с ценными бумагами, не обращающимися  на  организованном  рынке  ценных бумаг", Ложь, Ложь, ВычетыНДФЛ.Код202);
	ОписатьКодДоходаНДФЛ("Код1536", Ставка13, "1536", "Доход полученные по операциям купли-продажи ценных бумаг, не обращающихся на организованном рынке ценных бумаг, но отвечавших его требованиям", Ложь, Ложь, ВычетыНДФЛ.Код203);
	ОписатьКодДоходаНДФЛ("Код1537", Ставка13, "1537", "Доходы в виде процентов по займу, полученные по совокупности операций РЕПО", Ложь, Истина,   ВычетыНДФЛ.Код211);
	ОписатьКодДоходаНДФЛ("Код1538", Ставка13, "1538", "Доходы в виде процентов, полученные в налоговом периоде по совокупности договоров займа", Ложь, Истина, ВычетыНДФЛ.Код215);
	ОписатьКодДоходаНДФЛ("Код1539", Ставка13, "1539", "Доходы по операциям, связанным с открытием короткой позиции, являющимся объектом операций РЕПО", Ложь, Ложь, ВычетыНДФЛ.Код213);
	ОписатьКодДоходаНДФЛ("Код1541", Ставка13, "1541", "Доходы, получаемые в результате обмена ценных бумаг, переданных по первой части РЕПО",Ложь,Истина, ВычетыНДФЛ.Код620);
	
КонецПроцедуры	

Процедура ЗаполнитьКодыДоходов2015() Экспорт 
	
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	ВычетыНДФЛ = Справочники.ВидыВычетовНДФЛ;	
	
	ОписатьКодДоходаНДФЛ(, Ставка13, "1215", "Доходы в виде денежных (выкупных) сумм, выплачиваемые по договорам негосударственного пенсионного обеспечения");
	ОписатьКодДоходаНДФЛ(, Ставка13, "1219", "Суммы страховых взносов, в отношении которых был предоставлен социальный налоговый вычет, в случае расторжения договора добровольного пенс.страхования");
	ОписатьКодДоходаНДФЛ(, Ставка13, "1220", "Суммы страховых взносов, в отношении которых был предоставлен социальный налоговый вычет, учитыв. в случае расторжения негос. пенсионного обеспечения");
	ОписатьКодДоходаНДФЛ(, Ставка13, "1542", "Доходы в виде действительной стоимости доли в уставном капитале организации, выплачиваемые при выходе участника из организации");
	ОписатьКодДоходаНДФЛ(, Ставка13, "1550", "Доходы, полученные при уступке прав требования по договору участия в долевом строительстве");
	
КонецПроцедуры	

Процедура ЗаполнитьКодыДоходов2016() Экспорт 
	
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	ВычетыНДФЛ = Справочники.ВидыВычетовНДФЛ;	
	
	ОписатьКодДоходаНДФЛ("Код1532", Ставка13, "1532", "Доходы по опер. с произв.фин-выми инстр-ми, обр-ся на орг.рынке и базисным активом кот.явл. цен.бум., фонд.индексы, иные произв.фин-вые инстр-ты", Ложь, Ложь, ВычетыНДФЛ.Код205);
	ОписатьКодДоходаНДФЛ("Код1533", Ставка13, "1533", "Доходы по операциям с производными финансовыми инструментами, не обращающимися на организованном рынке", Ложь, Ложь, ВычетыНДФЛ.Код220);
	ОписатьКодДоходаНДФЛ("Код1535", Ставка13, "1535", "Доходы по опер. с произв.фин-выми инстр-ми, обр-ся на орг.рынке и базисным активом кот. не явл. цен.бум., фонд.индексы, иные произв.фин-вые инстр-ты", Ложь, Ложь, ВычетыНДФЛ.Код207);
	
	ОписатьКодДоходаНДФЛ("Код1543", Ставка13, "1543", "(не используется с 2016 года) Доходы по операциям, учитываемым на индивидуальном инвестиционном счете",Ложь,Ложь, ВычетыНДФЛ.ПустаяСсылка());
	
	ОписатьКодДоходаНДФЛ("Код1544", Ставка13, "1544", "Доходы по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете",Ложь,Ложь, ВычетыНДФЛ.Код221);
	ОписатьКодДоходаНДФЛ("Код1545", Ставка13, "1545", "Доходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете",Ложь,Ложь, ВычетыНДФЛ.Код226);
	ОписатьКодДоходаНДФЛ("Код1546", Ставка13, "1546", "Доходы по опер. с произв.фин-выми инстр-ми, обр-ся на орг.рынке и базисным активом кот.явл. цен.бум., фонд.индексы и пр., учит. на инд. инвест.счете",Ложь,Ложь, ВычетыНДФЛ.Код228);
	ОписатьКодДоходаНДФЛ("Код1547", Ставка13, "1547", "Доходы по операциям с производными финансовыми инструментами, не обращающимися на орг. рынке ценных бумаг, учитываемым на индивидуальном инвест.счете",Ложь,Ложь, ВычетыНДФЛ.Код235);
	ОписатьКодДоходаНДФЛ("Код1548", Ставка13, "1548", "Доходы по опер. с произв.фин-выми инстр., обр-ся на орг.рынке и базисным активом кот. не явл. цен.бум., фонд.индексы и пр., учит. на инд.инвест.счете",Ложь,Ложь, ВычетыНДФЛ.Код229);
	ОписатьКодДоходаНДФЛ("Код1549", Ставка13, "1549", "Доходы по опер. с ценными бум., не обр-ся на орг.рынке ц.бумаг, кот. при приобретении отвечали треб-ям для обр-хся ц.бум., учит. на инд. инвест.счете",Ложь,Ложь, ВычетыНДФЛ.Код227);
	
	ОписатьКодДоходаНДФЛ("Код1551", Ставка13, "1551", "Доходы в виде процентов по займу, полученные по совокупности операций РЕПО, учитываемых на индивидуальном инвестиционном счете",Ложь,Ложь, ВычетыНДФЛ.Код230);
	ОписатьКодДоходаНДФЛ("Код1552", Ставка13, "1552", "Доходы в виде процентов, полученных в налоговом периоде по совокупности договоров займа, учитываемых на индивидуальном инвестиционном счете",Ложь,Ложь, ВычетыНДФЛ.Код232);
	ОписатьКодДоходаНДФЛ("Код1553", Ставка13, "1553", "Доходы по операциям, связанным с открытием короткой позиции, являющимся объектом операций РЕПО, учитываемых на индивидуальном инвестиционном счете",Ложь,Ложь, ВычетыНДФЛ.Код231);
	ОписатьКодДоходаНДФЛ("Код1554", Ставка13, "1554", "Доходы, получаемые в результате обмена ценных бумаг, переданных по первой части РЕПО, учитываемых на индивидуальном инвестиционном счете");
	
	ОписатьКодДоходаНДФЛ("Код2002", Ставка13, "2002", "Суммы премий за производственные результаты, предусмотренные зак-вом РФ, трудовыми (коллективными) договорами кроме доходов с кодом 2003");
	ОписатьКодДоходаНДФЛ("Код2003", Ставка13, "2003", "Суммы вознаграждений, выплачиваемых за счет средств прибыли организации, средств специального назначения или целевых поступлений");
	
	ОписатьКодДоходаНДФЛ(, Ставка13, "2641", "Материальная выгода, полученная от приобретения производных финансовых инструментов");
	ОписатьКодДоходаНДФЛ("Код2791", Ставка13, "2791", "(не используется с 2016 года) Доходы, полученные работниками в натуральной форме в качестве оплаты труда от с/х товаропроизводителей, упл-х ЕСХН, и крестьянских х-в", Ложь, Ложь, ВычетыНДФЛ.ПустаяСсылка());
	ОписатьКодДоходаНДФЛ(, Ставка13, "3010", "Доходы в виде выигрышей, полученных в букмекерской конторе и тотализаторе");
	
КонецПроцедуры	

Процедура ОписатьКодДоходаНДФЛ(СсылкаИлиИмяПредопределенныхДанных = Неопределено, СтавкаНалогообложения = Неопределено, Код = "", Наименование = "", ВычетРассчитываетсяАвтоматически = Ложь, ИмеетЕдинственныйВычет = Ложь, ВычетПоУмолчанию = Неопределено, НеОблагаетсяУНалоговогоАгента = Ложь, СоответствуетОплатеТруда = Ложь)

	Если ТипЗнч(СсылкаИлиИмяПредопределенныхДанных) = Тип("Строка") И Не ПустаяСтрока(СсылкаИлиИмяПредопределенныхДанных) Тогда
		
		СсылкаПредопределенного = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходовНДФЛ." + СсылкаИлиИмяПредопределенныхДанных);
		Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
			Элемент = СсылкаПредопределенного.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.ВидыДоходовНДФЛ.СоздатьЭлемент();
			Элемент.ИмяПредопределенныхДанных = СсылкаИлиИмяПредопределенныхДанных;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(СсылкаИлиИмяПредопределенныхДанных) Тогда
			СсылкаНаЭлемент = СсылкаИлиИмяПредопределенныхДанных;
		Иначе
			СсылкаНаЭлемент = Справочники.ВидыДоходовНДФЛ.НайтиПоКоду(Код);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
			Элемент = СсылкаНаЭлемент.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.ВидыДоходовНДФЛ.СоздатьЭлемент();
		КонецЕсли;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Код) Тогда
		Элемент.Код = Код;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Элемент.Наименование = Наименование;
	КонецЕсли;

	Элемент.КодПрименяемыйВНалоговойОтчетностиС2010Года	= Элемент.Код;
	Элемент.СтавкаНалогообложенияРезидента		= ?(Не ЗначениеЗаполнено(СтавкаНалогообложения), Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13, СтавкаНалогообложения);
	Элемент.ВычетПоУмолчанию					= ВычетПоУмолчанию;
	Элемент.ВычетРассчитываетсяАвтоматически	= ВычетРассчитываетсяАвтоматически;
	Элемент.ИмеетЕдинственныйВычет				= ИмеетЕдинственныйВычет;
	Элемент.НеОблагаетсяУНалоговогоАгента		= НеОблагаетсяУНалоговогоАгента;
	Элемент.СоответствуетОплатеТруда			= СоответствуетОплатеТруда;
	
	Элемент.ОбменДанными.Загрузка = Истина;
	Элемент.Записать();

КонецПроцедуры	

Функция ДоходыПоСтавке13(НалоговыйПериод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка,
	|	ВЫБОР
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию)
	|			ТОГДА 1
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2010)
	|			ТОГДА 3
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2760)
	|			ТОГДА 4
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2762)
	|			ТОГДА 4
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2720)
	|			ТОГДА 5
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код4800)
	|			ТОГДА 5
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК Порядок,
	|	ВидыДоходовНДФЛ.Код КАК Код
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	ВидыДоходовНДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Код";
	
	Доходы = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Доходы.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Если НалоговыйПериод >= 2015 Тогда
		Доходы.Добавить(Справочники.ВидыДоходовНДФЛ.Код1010);
	КонецЕсли;
	
	Возврат Доходы;
	
КонецФункции

Функция ДоходыПоСтавке30(НалоговыйПериод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка,
	|	ВидыДоходовНДФЛ.Код КАК Код
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	ВидыДоходовНДФЛ.Ссылка <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Доходы = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Доходы.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Доходы;
	
КонецФункции

Функция ДоходыПоСтавке09(НалоговыйПериод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка,
	|	ВидыДоходовНДФЛ.Код КАК Код
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	ВидыДоходовНДФЛ.Ссылка <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	|	И ВидыДоходовНДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Доходы = Новый Массив;
	Если НалоговыйПериод < 2015 Тогда
		Доходы.Добавить(Справочники.ВидыДоходовНДФЛ.Код1010);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Доходы.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Доходы;
	
КонецФункции

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
// Используется для сопоставления элементов механизмом «Выгрузка/загрузка областей данных».
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли

#КонецОбласти
